IngaChen_ingachen/wk_7/member_list/app/controllers/members_controller.rb

INSERT INTO "members" ("avatar_file_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["avatar_file_name", "#<ActionDispatch::Http::UploadedFile:0x007fc6dd1e6e90>"], ["created_at", "2015-11-24 06:45:49.942986"], ["updated_at", "2015-11-24 06:45:49.942986"]]
---
  def create
    @member = Member.create(member_params)