IngaChen_ingachen/wk_9/UserAPI/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		render :json => User.all, status: 200

INSERT INTO "users" ("firstname", "lastname", "created_at", "updated_at", "auth_token") VALUES (?, ?, ?, ?, ?)  [["firstname", "Bob"], ["lastname", "Jones"], ["created_at", "2015-12-04 04:18:00.716910"], ["updated_at", "2015-12-04 04:18:00.716910"], ["auth_token", "38dba80adc7946fe9f466f6fb107beaf"]]
---
	def create
		user = User.create(user_params)