IngaChen_ingachen/hw_9/Mail API /app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = ?  [["user_id", 2]]
---
  def index
    render json: Message.where(user_id: @auth_user.id), status: 200

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = ? AND "messages"."status" = ?  [["user_id", 1], ["status", "sent"]]
---
  def sent
    render json: Message.where(user_id: @auth_user.id, status: "sent")

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 1]]
---
  def destroy
    maybe_message do |message|
      message.destroy